ИТ_Фирма/src/Documents/ПоступлениеДенежныхСредств/ПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетСКонтрагентами</registerRecords>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

ИТ_Фирма/src/AccumulationRegisters/ВзаиморасчетСКонтрагентами/ВзаиморасчетСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/Documents/ПоступлениеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчет = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвиженияВзаиморасчет.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвиженияВзаиморасчет.Контрагент = Плательщик;
	ДвиженияВзаиморасчет.Сумма = Сумма;
	ДвиженияВзаиморасчет.Период = Дата;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры
